csvke/phone_p4_JC4880P433C/sdkconfig.defaults
# ESP-IDF 5.5.1 base config for JC4880P4 phone
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# ========================================
# PSRAM Configuration - FIXED
# ========================================
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_MODE_HEX=y

# CRITICAL: Completely disable XIP from PSRAM
CONFIG_SPIRAM_XIP_FROM_PSRAM=n
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=n
CONFIG_SPIRAM_RODATA=n
CONFIG_SPIRAM_FLASH_LOAD_TO_PSRAM=n

# Enable PSRAM for heap allocation
CONFIG_SPIRAM_USE=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=n
CONFIG_SPIRAM_MEMTEST=y

# Optimize memory allocation thresholds
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=8192
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=16384
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# Disable external memory for .bss and .noinit
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=n
CONFIG_SPIRAM_ALLOW_NOINIT_SEG_EXTERNAL_MEMORY=n

# ========================================
# Memory Optimization
# ========================================
CONFIG_ESP_SYSTEM_IN_IRAM=y
CONFIG_ESP_SYSTEM_ALLOW_RTC_FAST_MEM_AS_HEAP=y

# Reduce task stack sizes where possible
CONFIG_ESP_MAIN_TASK_STACK_SIZE=3072
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=2048
CONFIG_ESP_MINIMAL_SHARED_STACK_SIZE=2048

# Optimize FreeRTOS
CONFIG_FREERTOS_IN_IRAM=y
CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=y

# Standard logging levels
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y

# WiFi optimization
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=8

# Enable specific flash chip support for better performance
CONFIG_SPI_FLASH_SUPPORT_BOYA_CHIP=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FREERTOS_HZ=1000
CONFIG_VFS_MAX_COUNT=15

# BSP and LVGL config (BSP_* symbols removed; behavior set in code)
# CONFIG_LV_COLOR_SCREEN_TRANSP=y
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=y
CONFIG_LV_USE_SNAPSHOT=y

# LVGL memory configuration - use clib malloc which uses PSRAM via heap allocator
# CONFIG_LV_USE_BUILTIN_MALLOC is not set
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y

# Brookesia configuration - disable AI framework and speaker system (not working for now)
CONFIG_ESP_BROOKESIA_ENABLE_AI_FRAMEWORK=n
CONFIG_ESP_BROOKESIA_SYSTEMS_ENABLE_SPEAKER=n

# Fonts and demos for Brookesia
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_34=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_USE_MONKEY=y
CONFIG_LV_USE_DEMO_WIDGETS=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# ========================================
# WiFi Configuration (ESP32-C6 via ESP-Hosted)
# ========================================
# Select ESP32-C6 as the WiFi slave target
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y

# WiFi performance optimization (already set above in Memory Optimization section)
# CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=8
# CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=64
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP_WIFI_TX_BA_WIN=32
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y
CONFIG_ESP_WIFI_RX_BA_WIN=32

# LWIP TCP/UDP buffer optimization
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=65534
CONFIG_LWIP_TCP_WND_DEFAULT=65534
CONFIG_LWIP_TCP_RECVMBOX_SIZE=64
CONFIG_LWIP_UDP_RECVMBOX_SIZE=64
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=64
CONFIG_LWIP_TCP_SACK_OUT=y

# ========================================
# Camera Configuration (OV02C10 MIPI CSI)
# ========================================
CONFIG_CAMERA_OV02C10=y
CONFIG_CAMERA_OV02C10_AUTO_DETECT=y
CONFIG_CAMERA_OV02C10_AUTO_DETECT_MIPI_INTERFACE_SENSOR=y
# Use 2-lane MIPI CSI with full resolution (1920x1080) @ 30fps
# Provides maximum quality with hardware ISP scaling to 480x800 display
# Camera configuration (OV02C10) - Production config: 1-lane 1288x728 @ 30 FPS
CONFIG_CAMERA_OV02C10_MIPI_RAW10_1288x728_30FPS=y
# CONFIG_CAMERA_OV02C10_MIPI_RAW10_1920x1080_30FPS is not set
# CONFIG_CAMERA_OV02C10_MIPI_RAW10_1920x1080_2LAN_30FPS is not set
CONFIG_CAMERA_OV02C10_MIPI_IF_FORMAT_INDEX_DAFAULT=0
CONFIG_CAMERA_OV02C10_CSI_LINESYNC_ENABLE=y
CONFIG_CAMERA_OV02C10_ISP_AF_ENABLE=y
CONFIG_CAMERA_OV02C10_DEFAULT_IPA_JSON_CONFIGURATION_FILE=y
CONFIG_CAMERA_XCLK_USE_ESP_CLOCK_ROUTER=y

# ESP Video processing
CONFIG_ESP_VIDEO_ENABLE_ISP=y
CONFIG_ESP_VIDEO_ENABLE_ISP_PIPELINE_CONTROLLER=y
CONFIG_ESP_VIDEO_ENABLE_BITSCRAMBLER=y
CONFIG_ESP_VIDEO_ENABLE_DATA_PREPROCESSING=y
CONFIG_ESP_VIDEO_CHECK_PARAMETERS=y
CONFIG_ESP_VIDEO_ENABLE_MIPI_CSI_VIDEO_DEVICE=y
CONFIG_ESP_VIDEO_DISABLE_MIPI_CSI_DRIVER_BACKUP_BUFFER=y
CONFIG_ESP_VIDEO_ENABLE_DVP_VIDEO_DEVICE=y
CONFIG_ESP_VIDEO_ENABLE_ISP_VIDEO_DEVICE=y
CONFIG_ESP_VIDEO_ENABLE_SWAP_SHORT=y
CONFIG_ESP_VIDEO_ENABLE_SWAP_SHORT_RISCV=y
CONFIG_ESP_VIDEO_ENABLE_SWAP_BYTE=y